iPhone7
屏幕尺寸：4.7英寸
显示分辨率：750X1334px
PPi：326
逻辑分辨率：340X667pt

三星GALAXY S6
屏幕尺寸：5.1英寸
显示分辨率：1440X2560px
PPi：576
逻辑分辨率：360X640pt

问题一：屏幕尺寸碎片化
问题二：不同分辨率下图片尺寸如何选择
问题三：ppi、px
问题四：Android dp和ppi转化 sp用于Android中字体

Android
-------------------------------------------------------------------------------------------
屏幕分类        屏幕密度    显示分辨率/px    代表手机               转 换   逻辑分辨率/dp

低Ldpi 	        120ppi      240x320          绝迹                   0.75    320x426   

中Mdpi          160ppi      320x480          iPhone3S/3.5英寸       1       320x480

高Hdpi          240ppi      480x800          小米1/4.7英寸          1.5     320x533   

超高XHdpi       320ppi      720x1280         小米红米/4.7英寸       2       360x640

超超高XXHdpi    480ppi      1080x1920        华为Mate7/6英寸        3       360x640

超超超高XXXHdpi 640ppi      1440x2560        三星GALAXYS7/5.1英寸   4       360x640

IOS
-------------------------------------------------------------------------------------------
设备         屏幕尺寸   显示分辨率/px   转换    逻辑分辨率/pt   宽高比例

iPhone3G     3.5英寸    320x480         @1x     320x480         0.666  

iPhone4/4S   3.5英寸    640x960         @2x     320x480         0.666

iPhone5C	 4英寸      640x1136        @2x     320x568         0.563

iPhone5/5S   4英寸      640x1136        @2x     320x568         0.563

iPhone6      4.7英寸    750x1334        @2x     375x667         0.562

iPhone6S     5.5英寸    1242x2208       @3x     414x763         0.562
						(1080x1920)

iPhone7      4.7英寸    750x1334        @2x     375x667         0.562

iPhone7S     5.5英寸    1242x2208       @3x     414x736         0.562
						(1080x1920)

iPhone5 326ppi
iPhone6 326ppi

iPhone6S 400ppi/460ppi


推荐适配分辨率
750x1334

720x1280 宽高：0.562










